Revit 2027 API
CutMarkType.CutLineAngle Property
 The rotation angle of the cut mark.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double CutLineAngle { get; set; }
Public Property CutLineAngle As Double
	Get
	Set
public:
property double CutLineAngle {
	double get ();
	void set (double value);
}
member CutLineAngle : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The given value for rotationAngle is not finite
See Also
Reference
CutMarkType Class
Autodesk.Revit.DB.Architecture Namespace